-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        10.5.9-MariaDB - mariadb.org binary distribution
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  11.0.0.5919
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- 테이블 used.account 구조 내보내기
CREATE TABLE IF NOT EXISTS `account` (
  `ac_num` int(11) NOT NULL AUTO_INCREMENT,
  `account_nm` varchar(50) CHARACTER SET utf8 DEFAULT NULL,
  `thstrm_nm` varchar(50) CHARACTER SET utf8 DEFAULT NULL,
  `thstrm_amount` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`ac_num`),
  KEY `thstrm_nm` (`thstrm_nm`)
) ENGINE=InnoDB AUTO_INCREMENT=480 DEFAULT CHARSET=latin1;

-- 테이블 데이터 used.account:~134 rows (대략적) 내보내기
DELETE FROM `account`;
/*!40000 ALTER TABLE `account` DISABLE KEYS */;
INSERT INTO `account` (`ac_num`, `account_nm`, `thstrm_nm`, `thstrm_amount`) VALUES
	(346, '유동자산', '제 52 기', 73798549000000),
	(347, '현금및현금성자산', '제 52 기', 989045000000),
	(348, '단기금융상품', '제 52 기', 29101284000000),
	(349, '매출채권', '제 52 기', 24736740000000),
	(350, '미수금', '제 52 기', 1898583000000),
	(351, '선급비용', '제 52 기', 890680000000),
	(352, '재고자산', '제 52 기', 13831372000000),
	(353, '기타유동자산', '제 52 기', 2350845000000),
	(354, '비유동자산', '제 52 기', 155865878000000),
	(355, '기타포괄손익-공정가치금융자산', '제 52 기', 1539659000000),
	(356, '당기손익-공정가치금융자산', '제 52 기', 3107000000),
	(357, '종속기업, 관계기업 및 공동기업 투자', '제 52 기', 56587548000000),
	(358, '유형자산', '제 52 기', 86166924000000),
	(359, '무형자산', '제 52 기', 7002648000000),
	(360, '순확정급여자산', '제 52 기', 1162456000000),
	(361, '이연법인세자산', '제 52 기', 992385000000),
	(362, '기타비유동자산', '제 52 기', 2411151000000),
	(363, '자산총계', '제 52 기', 229664427000000),
	(364, '유동부채', '제 52 기', 44412904000000),
	(365, '매입채무', '제 52 기', 6599025000000),
	(366, '단기차입금', '제 52 기', 12520367000000),
	(367, '미지급금', '제 52 기', 9829541000000),
	(368, '선수금', '제 52 기', 424368000000),
	(369, '예수금', '제 52 기', 432714000000),
	(370, '미지급비용', '제 52 기', 7927017000000),
	(371, '당기법인세부채', '제 52 기', 3556146000000),
	(372, '유동성장기부채', '제 52 기', 87571000000),
	(373, '충당부채', '제 52 기', 2932468000000),
	(374, '기타유동부채', '제 52 기', 103687000000),
	(375, '비유동부채', '제 52 기', 1934799000000),
	(376, '사채', '제 52 기', 31909000000),
	(377, '장기차입금', '제 52 기', 150397000000),
	(378, '장기미지급금', '제 52 기', 1247752000000),
	(379, '장기충당부채', '제 52 기', 503035000000),
	(380, '기타비유동부채', '제 52 기', 1706000000),
	(381, '부채총계', '제 52 기', 46347703000000),
	(382, '자본금', '제 52 기', 897514000000),
	(383, '우선주자본금', '제 52 기', 119467000000),
	(384, '보통주자본금', '제 52 기', 778047000000),
	(385, '주식발행초과금', '제 52 기', 4403893000000),
	(386, '이익잉여금(결손금)', '제 52 기', 178284102000000),
	(387, '기타자본항목', '제 52 기', -268785000000),
	(388, '자본총계', '제 52 기', 183316724000000),
	(389, '부채와자본총계', '제 52 기', 229664427000000),
	(390, '수익(매출액)', '제 52 기', 166311191000000),
	(391, '매출원가', '제 52 기', 116753419000000),
	(392, '매출총이익', '제 52 기', 49557772000000),
	(393, '판매비와관리비', '제 52 기', 29038798000000),
	(394, '영업이익', '제 52 기', 20518974000000),
	(395, '기타수익', '제 52 기', 797494000000),
	(396, '기타비용', '제 52 기', 857242000000),
	(397, '금융수익', '제 52 기', 5676877000000),
	(398, '금융비용', '제 52 기', 5684180000000),
	(399, '법인세비용차감전순이익(손실)', '제 52 기', 20451923000000),
	(400, '법인세비용', '제 52 기', 4836905000000),
	(401, '계속영업이익(손실)', '제 52 기', 15615018000000),
	(402, '당기순이익(손실)', '제 52 기', 15615018000000),
	(403, '기본주당이익(손실)', '제 52 기', 2299),
	(404, '희석주당이익(손실)', '제 52 기', 2299),
	(405, '당기순이익(손실)', '제 52 기', 15615018000000),
	(406, '기타포괄손익', '제 52 기', -549299000000),
	(407, '후속적으로 당기손익으로 재분류되지 않는 포괄손익', '제 52 기', -549299000000),
	(408, '기타포괄손익-공정가치금융자산평가손익', '제 52 기', 93251000000),
	(409, '순확정급여부채(자산) 재측정요소', '제 52 기', -642550000000),
	(410, '후속적으로 당기손익으로 재분류되는 포괄손익', '제 52 기', 0),
	(411, '총포괄손익', '제 52 기', 15065719000000),
	(412, '영업활동 현금흐름', '제 52 기', 37509025000000),
	(413, '영업에서 창출된 현금흐름', '제 52 기', 39541654000000),
	(414, '당기순이익', '제 52 기', 15615018000000),
	(415, '조정', '제 52 기', 24319842000000),
	(416, '영업활동으로 인한 자산부채의 변동', '제 52 기', -393206000000),
	(417, '이자의 수취', '제 52 기', 448323000000),
	(418, '이자의 지급', '제 52 기', 148262000000),
	(419, '배당금 수입', '제 52 기', 129569000000),
	(420, '법인세 납부액', '제 52 기', 2462259000000),
	(421, '투자활동 현금흐름', '제 52 기', -31175575000000),
	(422, '단기금융상품의 순감소(증가)', '제 52 기', -2099892000000),
	(423, '장기금융상품의 처분', '제 52 기', 0),
	(424, '장기금융상품의 취득', '제 52 기', 0),
	(425, '기타포괄손익-공정가치금융자산의 처분', '제 52 기', 503000000),
	(426, '기타포괄손익-공정가치금융자산의 취득', '제 52 기', -204957000000),
	(427, '당기손익-공정가치금융자산의 처분', '제 52 기', 74000000),
	(428, '당기손익-공정가치금융자산의 취득', '제 52 기', 0),
	(429, '종속기업, 관계기업 및 공동기업 투자의 처분', '제 52 기', 22057000000),
	(430, '종속기업, 관계기업 및 공동기업 투자의 취득', '제 52 기', -163456000000),
	(431, '유형자산의 처분', '제 52 기', 431142000000),
	(432, '유형자산의 취득', '제 52 기', 26962042000000),
	(433, '무형자산의 처분', '제 52 기', 1082000000),
	(434, '무형자산의 취득', '제 52 기', 2239834000000),
	(435, '사업결합으로 인한 현금유출액', '제 52 기', 0),
	(436, '기타투자활동으로 인한 현금유출입액', '제 52 기', 39748000000),
	(437, '재무활동 현금흐름', '제 52 기', -7426376000000),
	(438, '단기차입금의 순증가(감소)', '제 52 기', 2326350000000),
	(439, '자기주식의 취득', '제 52 기', 0),
	(440, '사채 및 장기차입금의 상환', '제 52 기', 134443000000),
	(441, '배당금의 지급', '제 52 기', 9618283000000),
	(442, '외화환산으로 인한 현금의 변동', '제 52 기', 54000000),
	(443, '현금및현금성자산의 순증감', '제 52 기', -1092872000000),
	(444, '기초의 현금및현금성자산', '제 52 기', 2081917000000),
	(445, '기말의 현금및현금성자산', '제 52 기', 989045000000),
	(446, '기초자본', '제 52 기', 177870247000000),
	(447, '기초자본', '제 52 기', 280514000000),
	(448, '기초자본', '제 52 기', 172288326000000),
	(449, '기초자본', '제 52 기', 897514000000),
	(450, '기초자본', '제 52 기', 4403893000000),
	(451, '회계정책변경누적효과', '제 52 기', 0),
	(452, '회계정책변경누적효과', '제 52 기', 0),
	(453, '회계정책변경누적효과', '제 52 기', 0),
	(454, '회계정책변경누적효과', '제 52 기', 0),
	(455, '회계정책변경누적효과', '제 52 기', 0),
	(456, '수정후 기초자본', '제 52 기', 177870247000000),
	(457, '수정후 기초자본', '제 52 기', 280514000000),
	(458, '수정후 기초자본', '제 52 기', 172288326000000),
	(459, '수정후 기초자본', '제 52 기', 897514000000),
	(460, '수정후 기초자본', '제 52 기', 4403893000000),
	(461, '당기순이익(손실)', '제 52 기', 15615018000000),
	(462, '당기순이익(손실)', '제 52 기', 15615018000000),
	(463, '기타포괄손익-공정가치금융자산평가손익', '제 52 기', 93251000000),
	(464, '기타포괄손익-공정가치금융자산평가손익', '제 52 기', 93251000000),
	(465, '기타포괄손익-공정가치금융자산평가손익', '제 52 기', 0),
	(466, '순확정급여부채(자산) 재측정요소', '제 52 기', -642550000000),
	(467, '순확정급여부채(자산) 재측정요소', '제 52 기', -642550000000),
	(468, '배당', '제 52 기', 9619242000000),
	(469, '배당', '제 52 기', 9619242000000),
	(470, '자기주식의 취득', '제 52 기', 0),
	(471, '자기주식의 취득', '제 52 기', 0),
	(472, '자기주식의 소각', '제 52 기', 0),
	(473, '자기주식의 소각', '제 52 기', 0),
	(474, '자기주식의 소각', '제 52 기', 0),
	(475, '기말자본', '제 52 기', 183316724000000),
	(476, '기말자본', '제 52 기', -268785000000),
	(477, '기말자본', '제 52 기', 178284102000000),
	(478, '기말자본', '제 52 기', 897514000000),
	(479, '기말자본', '제 52 기', 4403893000000);
/*!40000 ALTER TABLE `account` ENABLE KEYS */;

-- 테이블 used.offer 구조 내보내기
CREATE TABLE IF NOT EXISTS `offer` (
  `o_num` int(11) NOT NULL AUTO_INCREMENT,
  `a_num` int(11) NOT NULL,
  `o_username` varchar(50) NOT NULL,
  `o_price` bigint(50) NOT NULL,
  `o_time` datetime NOT NULL DEFAULT current_timestamp(),
  `o_select` tinyint(4) NOT NULL DEFAULT 0,
  `o_skip` tinyint(4) NOT NULL DEFAULT 0,
  `o_endtime` datetime DEFAULT NULL,
  PRIMARY KEY (`o_num`) USING BTREE,
  KEY `a_num` (`a_num`),
  KEY `o_username` (`o_username`)
) ENGINE=InnoDB AUTO_INCREMENT=84 DEFAULT CHARSET=utf8;

-- 테이블 데이터 used.offer:~9 rows (대략적) 내보내기
DELETE FROM `offer`;
/*!40000 ALTER TABLE `offer` DISABLE KEYS */;
INSERT INTO `offer` (`o_num`, `a_num`, `o_username`, `o_price`, `o_time`, `o_select`, `o_skip`, `o_endtime`) VALUES
	(61, 20, 'c@c', 1000000, '2021-04-29 15:22:30', 0, 0, '0000-00-00 00:00:00'),
	(63, 26, 'c@c', 1000000, '2021-04-29 15:52:02', 1, 0, '2021-05-18 10:14:20'),
	(64, 27, 'c@c', 1000000, '2021-04-29 15:58:12', 1, 0, '0000-00-00 00:00:00'),
	(71, 22, 'c@c', 1000000, '2021-04-30 10:26:29', 1, 0, '0000-00-00 00:00:00'),
	(73, 26, 'c@c', 900000, '2021-04-30 10:26:52', 0, 0, '0000-00-00 00:00:00'),
	(74, 20, 'f@f', 900000, '2021-04-30 11:02:51', 1, 0, '0000-00-00 00:00:00'),
	(81, 28, 'c@c', 17000000, '2021-05-03 12:33:28', 1, 0, '2021-05-18 06:14:20'),
	(82, 31, 'kk@kk', 100000000, '2021-05-05 10:48:21', 0, 0, '0000-00-00 00:00:00'),
	(83, 45, 'kk@kk', 1500000000, '2021-05-17 09:52:24', 0, 0, '0000-00-00 00:00:00');
/*!40000 ALTER TABLE `offer` ENABLE KEYS */;

-- 테이블 used.turnover 구조 내보내기
CREATE TABLE IF NOT EXISTS `turnover` (
  `t_num` int(11) NOT NULL AUTO_INCREMENT,
  `t_year` year(4) NOT NULL,
  `t_month` int(11) NOT NULL,
  `t_amount` bigint(100) NOT NULL,
  PRIMARY KEY (`t_num`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=latin1;

-- 테이블 데이터 used.turnover:~5 rows (대략적) 내보내기
DELETE FROM `turnover`;
/*!40000 ALTER TABLE `turnover` DISABLE KEYS */;
INSERT INTO `turnover` (`t_num`, `t_year`, `t_month`, `t_amount`) VALUES
	(1, '2021', 1, 100000000),
	(2, '2021', 2, 90000000),
	(3, '2021', 3, 120000000),
	(4, '2021', 4, 180000000),
	(5, '2020', 12, 170000000);
/*!40000 ALTER TABLE `turnover` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
